using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TODO : MonoBehaviour
{
    //Игнорировать других персонажей кроме противников (PlayerType)
    //Оптимизировать дальность полета и дельту для зума.
            //Слишком маленькое расстояние оттягивания персонажа не должно его запускать.
            //Слишком сильное должно ограничевать зум и силу полета до заданных в LaunchManager
    //Вылет персонажа за край карты
    //Добавить противников
    //Attack System, impact
    //Эммитеры атаки
    //Нарисовать первый уровень
    //Перемещение пешек в зависимости от клика (может сделать UI?)
    //Зум - колесико мыши
    //Движение камеры по грабу левой клавишей мыши
    //Монетки для очков и предварительной траектории
    //Bool для полного и частиного отображения траектории
}
